{
  "education": [
    {
      "awards_achievements": [
        "Graduating with honors",
        "GPA: 3.9/4.0"
      ],
      "degree": "Diploma in Computer Programmer Program",
      "department": "Software Design \u0026 Data Science",
      "duration": "2019-2021",
      "school_name": "Seneca College"
    },
    {
      "awards_achievements": [
        "GPA: 3.7/4.0"
      ],
      "degree": "Certificate in Academic and Career Entrance Program",
      "department": "Arts \u0026 Science",
      "duration": "2018-2019",
      "school_name": "Seneca College"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor's Degree in Computer Science Program",
      "department": "Computer and Information Technology",
      "duration": "2013-2017",
      "school_name": "Jordan University of Science and Technology"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_NisreinHinnawi",
  "highlighted_projects": [
    {
      "description": "Built an Application using Client/Server architecture using Xamarin platform (C# Language) to show the users list of adoptable animals and allow them to get details about the animal, browse their photos, and mark any as favorite. The data was retrieved by using RESTful API services from Petfinder.com and was cached using SQLite for optimization. The Client-side has been implemented using an MVVM architectural pattern to keep the View and the logic separated. The application was tested using a real phone and emulator.",
      "git_url": null,
      "name": "CuteMe Application"
    },
    {
      "description": "Implemented face detection and identity hiding application using Java language to hide people's identities from others while streaming live videos on TV or the internet. OpenCV was used to perform image processing and to run object detection algorithms for human faces and then pixelate or replace the detected area with a staging image to hide the user identity.",
      "name": "Live Video Editor"
    },
    {
      "description": "Processed large-scale streaming data using Spark/Scala and Apache Hadoop. Operated huge data using DBLP dataset with more than 3.3 million records. DBLP was converted from XML to JSON using Java to make it easy for humans to read and write, and easy for machines to parse and generate. Represented DBLP data set using Postgres SQL database. The application was tested on an Ubuntu machine and using SQL queries.",
      "name": "DBLP Fast Searching Graduation Project"
    },
    {
      "description": "Built a travel website using Client/Server architecture using the Node JS platform to allow travellers to find a place to stay around the world, the website has many functionalities that allow the users to search and find what they want fast and easily. MongoDB was used to store user data, reservation data, and room information.",
      "git_url": "https://github.com/nesreen-henawi/WEB322",
      "name": "My Airbnb Web Application"
    },
    {
      "description": "Built a garage sale website using JavaScript language to do online garage sale shopping. The website has many sections and items that the user can browse by pictures, descriptions, and prices for each item. HTML was used to structure the website content, and CSS was used to define the style of the web pages.",
      "git_url": "https://github.com/nesreen-henawi/247GarageSale",
      "name": "247 Garage Sale Web Application"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux monitoring agent that helps the user record and monitors hardware specifications and usage information (e.g. CPU, RAM, Disk, etc.) for a Linux cluster in real-time and stores the data in a PostgreSQL database. The program was developed in Bash Scripts and tested on a virtual machine that uses CentOS 7 distribution, and the Docker container was used to provision the PostgreSQL database.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Nisrein Hinnawi",
  "others": [
    {
      "bullets": [
        "EMC Academic Associate Certificate(2017)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Soccer fan"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked as a Software Developer to develop various types of projects using a variety of technologies such as Linux, PostgreSQL, Java, Maven, Git, and IntelliJ.  Worked within a scrum team to deliver the projects by following the Agile framework. Played the team lead role and held the daily scrum, also helped the team solve any impediments.",
      "duration": "2020-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "IntelliJ",
      "Eclipse",
      "Visual  Studio",
      "Visual Studio Code",
      ".NET(C#)"
    ],
    "familiar": [
      "Java SDK",
      "Angular.js",
      "Xamarin",
      "IBM Zeus",
      "Hadoop framework"
    ],
    "proficient": [
      "Java",
      "C/C++",
      "JavaScript",
      "HTML/CSS",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I completed a Bachelor's degree in Computer Science from Jordan University of Science and Technology and a Diploma degree in Computer Programming from Seneca College with honor, and I have a. During my studies, I have grown immense interest and enthusiasm in the field of research and development due to its innovative nature. Thinking out of the box, implementing new ideas, and finally developing those ideas into innovations are some of the main reasons which attract me into this field. I can work on different project platforms built with Java, C/C++, or C#. I can adapt and be an active team member in a short time, learn quickly new techniques and software as I have a strong and thorough understanding of programming languages, and meet stringent deadlines if required."
}
